{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "word_id_inputs",
                0,
                0
            ],
            [
                "char_id_inputs",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null
                    ],
                    "dtype": "int32",
                    "name": "char_id_inputs",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "char_id_inputs"
            },
            {
                "class_name": "Embedding",
                "config": {
                    "activity_regularizer": null,
                    "batch_input_shape": [
                        null,
                        null
                    ],
                    "dtype": "float32",
                    "embeddings_constraint": null,
                    "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 0.05,
                            "minval": -0.05,
                            "seed": null
                        }
                    },
                    "embeddings_regularizer": null,
                    "input_dim": 136,
                    "input_length": null,
                    "mask_zero": true,
                    "name": "char_embedding_layer",
                    "output_dim": 30,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "char_id_inputs",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "char_embedding_layer"
            },
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null
                    ],
                    "dtype": "int32",
                    "name": "word_id_inputs",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "word_id_inputs"
            },
            {
                "class_name": "TimeDistributed",
                "config": {
                    "layer": {
                        "class_name": "Bidirectional",
                        "config": {
                            "layer": {
                                "class_name": "LSTM",
                                "config": {
                                    "activation": "tanh",
                                    "activity_regularizer": null,
                                    "bias_constraint": null,
                                    "bias_initializer": {
                                        "class_name": "Zeros",
                                        "config": {}
                                    },
                                    "bias_regularizer": null,
                                    "dropout": 0.0,
                                    "go_backwards": false,
                                    "implementation": 1,
                                    "kernel_constraint": null,
                                    "kernel_initializer": {
                                        "class_name": "VarianceScaling",
                                        "config": {
                                            "distribution": "uniform",
                                            "mode": "fan_avg",
                                            "scale": 1.0,
                                            "seed": null
                                        }
                                    },
                                    "kernel_regularizer": null,
                                    "name": "lstm_1",
                                    "recurrent_activation": "hard_sigmoid",
                                    "recurrent_constraint": null,
                                    "recurrent_dropout": 0.0,
                                    "recurrent_initializer": {
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "gain": 1.0,
                                            "seed": null
                                        }
                                    },
                                    "recurrent_regularizer": null,
                                    "return_sequences": false,
                                    "return_state": false,
                                    "stateful": false,
                                    "trainable": true,
                                    "unit_forget_bias": true,
                                    "units": 100,
                                    "unroll": false,
                                    "use_bias": true
                                }
                            },
                            "merge_mode": "concat",
                            "name": "bidirectional_1",
                            "trainable": true
                        }
                    },
                    "name": "character_BiLSTM",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "char_embedding_layer",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "character_BiLSTM"
            },
            {
                "class_name": "Embedding",
                "config": {
                    "activity_regularizer": null,
                    "batch_input_shape": [
                        null,
                        null
                    ],
                    "dtype": "float32",
                    "embeddings_constraint": null,
                    "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 0.05,
                            "minval": -0.05,
                            "seed": null
                        }
                    },
                    "embeddings_regularizer": null,
                    "input_dim": 75196,
                    "input_length": null,
                    "mask_zero": true,
                    "name": "word_embedding_layer",
                    "output_dim": 200,
                    "trainable": false
                },
                "inbound_nodes": [
                    [
                        [
                            "word_id_inputs",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "word_embedding_layer"
            },
            {
                "class_name": "SpatialDropout1D",
                "config": {
                    "name": "spatial_dropout1d_1",
                    "noise_shape": null,
                    "rate": 0.3,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "character_BiLSTM",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "spatial_dropout1d_1"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "name": "concatenate_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "word_embedding_layer",
                            0,
                            0,
                            {}
                        ],
                        [
                            "spatial_dropout1d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_1"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "noise_shape": null,
                    "rate": 0.3,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_1"
            },
            {
                "class_name": "Bidirectional",
                "config": {
                    "layer": {
                        "class_name": "LSTM",
                        "config": {
                            "activation": "tanh",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "dropout": 0.3,
                            "go_backwards": false,
                            "implementation": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "lstm_2",
                            "recurrent_activation": "hard_sigmoid",
                            "recurrent_constraint": null,
                            "recurrent_dropout": 0.1,
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "recurrent_regularizer": null,
                            "return_sequences": true,
                            "return_state": false,
                            "stateful": false,
                            "trainable": true,
                            "unit_forget_bias": true,
                            "units": 100,
                            "unroll": false,
                            "use_bias": true
                        }
                    },
                    "merge_mode": "concat",
                    "name": "word_BiLSTM_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "word_BiLSTM_1"
            },
            {
                "class_name": "SpatialDropout1D",
                "config": {
                    "name": "spatial_dropout1d_2",
                    "noise_shape": null,
                    "rate": 0.3,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "word_BiLSTM_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "spatial_dropout1d_2"
            },
            {
                "class_name": "Bidirectional",
                "config": {
                    "layer": {
                        "class_name": "LSTM",
                        "config": {
                            "activation": "tanh",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "dropout": 0.3,
                            "go_backwards": false,
                            "implementation": 1,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "lstm_3",
                            "recurrent_activation": "hard_sigmoid",
                            "recurrent_constraint": null,
                            "recurrent_dropout": 0.1,
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "recurrent_regularizer": null,
                            "return_sequences": true,
                            "return_state": false,
                            "stateful": false,
                            "trainable": true,
                            "unit_forget_bias": true,
                            "units": 100,
                            "unroll": false,
                            "use_bias": true
                        }
                    },
                    "merge_mode": "concat",
                    "name": "word_BiLSTM_2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "spatial_dropout1d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "word_BiLSTM_2"
            },
            {
                "class_name": "SpatialDropout1D",
                "config": {
                    "name": "spatial_dropout1d_3",
                    "noise_shape": null,
                    "rate": 0.3,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "word_BiLSTM_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "spatial_dropout1d_3"
            },
            {
                "class_name": "TimeDistributed",
                "config": {
                    "layer": {
                        "class_name": "Dense",
                        "config": {
                            "activation": "relu",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "dense_1",
                            "trainable": true,
                            "units": 77,
                            "use_bias": true
                        }
                    },
                    "name": "dense_layer",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "spatial_dropout1d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_layer"
            },
            {
                "class_name": "CRF",
                "config": {
                    "activation": "linear",
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "boundary_constraint": null,
                    "boundary_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "boundary_regularizer": null,
                    "chain_constraint": null,
                    "chain_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "chain_regularizer": null,
                    "input_dim": 77,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "learn_mode": "join",
                    "name": "crf_classifier",
                    "sparse_target": false,
                    "test_mode": "viterbi",
                    "trainable": true,
                    "units": 4,
                    "unroll": false,
                    "use_bias": true,
                    "use_boundary": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_layer",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "crf_classifier"
            }
        ],
        "name": "model_1",
        "output_layers": [
            [
                "crf_classifier",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.2.2"
}